I am having the same issue:

Code

```terraform
locals {
  service_identities = toset([
    "artifactregistry.googleapis.com",
    # "datafusion.googleapis.com",
    # "file.googleapis.com",
    # "secretmanager.googleapis.com",
    # "spanner.googleapis.com",
  ])
}

data "google_project" "project" {}

resource "google_project_service_identity" "project" {
  provider = google-beta
  for_each = local.service_identities

  project = data.google_project.project.id
  service = each.key
}

```

Output

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.services.google_project_service_identity.project["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service_identity" "project" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "projects/<project>"
      + service = "artifactregistry.googleapis.com"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.services.google_project_service_identity.project["artifactregistry.googleapis.com"]: Creating...
╷
│ Error: Error creating Service Identity: googleapi: got HTTP response code 404 with body: <!DOCTYPE html>
│ <html lang=en>
│   <meta charset=utf-8>
│   <meta name=viewport content="initial-scale=1, minimum-scale=1, width=device-width">
│   <title>Error 404 (Not Found)!!1</title>
│   <style>
│     *{margin:0;padding:0}html,code{font:15px/22px arial,sans-serif}html{background:#fff;color:#222;padding:15px}body{margin:7% auto 0;max-width:390px;min-height:180px;padding:30px 0 15px}* > body{background:url(//www.google.com/images/errors/robot.png) 100% 5px no-repeat;padding-right:205px}p{margin:11px 0 22px;overflow:hidden}ins{color:#777;text-decoration:none}a img{border:0}@media screen and (max-width:772px){body{background:none;margin-top:0;max-width:none;padding-right:0}}#logo{background:url(//www.google.com/images/branding/googlelogo/1x/googlelogo_color_150x54dp.png) no-repeat;margin-left:-5px}@media only screen and (min-resolution:192dpi){#logo{background:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) no-repeat 0% 0%/100% 100%;-moz-border-image:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) 0}}@media only screen and (-webkit-min-device-pixel-ratio:2){#logo{background:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) no-repeat;-webkit-background-size:100% 100%}}#logo{display:inline-block;height:54px;width:150px}
│   </style>
│   <a href=//www.google.com/><span id=logo aria-label=Google></span></a>
│   <p><b>404.</b> <ins>That’s an error.</ins>
│   <p>The requested URL <code>/v1beta1/projects/projects/<project>/services/artifactregistry.googleapis.com:generateServiceIdentity?alt=json</code> was not found on this server.  <ins>That’s all we know.</ins>
│
│
│   with module.services.google_project_service_identity.project["artifactregistry.googleapis.com"],
│   on ../../../modules/services/main.tf line 87, in resource "google_project_service_identity" "project":
│   87: resource "google_project_service_identity" "project" {
│
```

CLI works
```
$ gcloud beta services identity create --service "artifactregistry.googleapis.com"
Service identity created: service-443860974529@gcp-sa-artifactregistry.iam.gserviceaccount.com
```